tap "hashicorp/tap"
tap "homebrew/services"
tap "mutagen-io/mutagen"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "argocd"
brew "asdf"
brew "pycparser"
brew "cffi"
brew "awscli"
brew "boost"
brew "glib"
brew "cmake"
brew "lima"
brew "colima"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "dockerize"
brew "docutils"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "eksctl"
brew "evans"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "python@3.12"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "findutils"
brew "gh"
brew "git-secrets"
brew "gitleaks"
brew "node"
brew "gitmoji"
brew "gnupg"
brew "grpcurl"
brew "helm"
brew "helmfile"
brew "iam-policy-json-to-terraform"
brew "jq"
brew "kubernetes-cli"
brew "libpq"
brew "libyaml"
brew "mysql-client@8.0"
brew "mysql@8.0", link: true
brew "openjdk"
brew "peco"
brew "pinentry-mac"
brew "pkgconf"
brew "postgresql@15"
brew "python@3.11"
brew "qemu"
brew "reattach-to-user-namespace"
brew "saml2aws"
brew "sops"
brew "tmux"
brew "tree"
brew "watchman"
brew "yamlfmt"
brew "yq"
brew "hashicorp/tap/terraform"
brew "mutagen-io/mutagen/mutagen-compose"
cask "clipy"
cask "deepl"
cask "displaylink"
cask "drawio"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "hammerspoon"
cask "jetbrains-toolbox"
cask "kindle"
cask "ngrok"
cask "notion"
cask "postman"
cask "rectangle"
cask "rubymine"
cask "session-manager-plugin"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "xquartz"
cask "zoom"
vscode "aeschli.vscode-css-formatter"
vscode "arjun.swagger-viewer"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "genieai.chatgpt-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hangxingliu.vscode-nginx-conf-hint"
vscode "hashicorp.terraform"
vscode "hridoy.rails-snippets"
vscode "ics.japanese-proofreading"
vscode "janisdd.vscode-edit-csv"
vscode "juanblanco.solidity"
vscode "koichisasada.vscode-rdbg"
vscode "ktnrg45.vscode-cython"
vscode "miguel-savignano.ruby-symbols"
vscode "misogi.ruby-rubocop"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "noku.rails-run-spec-vscode"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "seatonjiang.gitmoji-vscode"
vscode "shanoor.vscode-nginx"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shinichi-takii.sql-bigquery"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "sporto.rails-go-to-spec"
vscode "sporto2.rails-go-to-spec-2"
vscode "streetsidesoftware.code-spell-checker"
vscode "thadeu.vscode-run-rspec-file"
vscode "vadimcn.vscode-lldb"
